/// 단축키
/// F2 누르면 에러 발생한 곳으로 이동
/// 코드 정리 = ctrl + alt + l
/// 주석 = ctrl + /
/// 바로 아래 복사 = ctrl + d
/// 괄호 안에서 ctrl + p =입력해야 하는 것들이 나옴
/// 파일에 놓고 shift + f6
/// alt + p
/// alt + insert : 클래스에서 생성자 만들기 constructor
/// 파일이름 + e
///
///
///
/// 개발이 진행되는 과정(앱)
///
/// 1. 기획 디자인 결정, api 완료 ->진행이 수월함
/// 기획 ppt
/// 디자인 피그마, 제플린
/// 서버 개발 / api 이미 존재
///
/// 2. 기획, 디자인, 서버 미정 ->진행이 더딤
/// 기획, 디자인 없음 -> 해달라
/// 기획 단계에서 가능 유무, 개발, 비즈니스적 관점 판단
/// 개발자도 기획단게에서 같이 참여
/// 기획이 나오면 디자인이 나옴
///
/// 3.모든게 미정 -> 오래걸림, 디아블로
/// 기획, 디자인, 서비, 앱 전부 미정
/// 하드웨어도 없음
/// 하으뒈어 자체 결함이 있을 수 있음
/// 하드웨어가 문제가 없다는 것을 소프트웨어에서 검증 필요
///
///
/// android studio github 연동
/// 세팅 버전컨트롤 깃
///
/// https://jinhan38.com/